package data

var PrimaryWeights = map[string]int{
	"ИК/Р": 9, "АК/Р": 8, "Д/С": 8, "ИКД": 8, "Пр-т": 8,
	"ВКР": 7, "ВКД": 7, "К/Р": 7, "КД": 7, "Д": 6,
	"И": 6, "КОРР": 6, "СОЧ": 6, "ТЧ": 6, "КС": 5,
	"СПИС": 5, "М/Д": 4, "ПР": 4, "С/Р": 4, "СД": 4,
	"Тест": 4, "ДОК": 3, "Д/Р": 3, "Наиз": 3, "ПЗ": 3,
	"РНО": 3, "ДУ": 2, "Р/У": 2, "Чт/В": 2, "ОТВ": 1,
}

var SecondaryWeights = map[string]int{
	"ПА": 10, "ИК/Р": 9, "АК/Р": 8, "Д/С": 8, "ИКД": 8,
	"Пр-т": 8, "ВКР": 7, "ВКД": 7, "К/Р": 7, "КД": 7,
	"Зчт": 6, "И": 6, "КОРР": 6, "СОЧ": 6, "ТЧ": 6,
	"АУД": 4, "ДИАЛ": 4, "ЛЗ": 4, "М/Д": 4, "ПИС": 4,
	"ПрЗ": 4, "ПР": 4, "РЕФ": 4, "С/Р": 4, "СД": 4,
	"Тест": 4, "ДОК": 3, "Д/Р": 3, "Л/Р": 3, "Наиз": 3,
	"П/Р": 3, "РНО": 3, "К/К": 3, "ТР": 3, "ДУ": 2,
	"Р/У": 2, "Р/Т": 2, "ЧИТ": 2, "ОТВ": 1,
}
